[Regrouper les données dissociées par formule Python dans Excel](https://www.youtube.com/watch?v=zTf097gSKzc&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=32)

Date : 26/06/2025

In [1]:
import pandas as pd

In [3]:
tabR = pd.read_excel('data/Unstack.xlsx', sheet_name='Feuil1')
tabR.head()

   Ville       Mois  Valeur
0  Paris       Juin   66150
1  Paris    Juillet  127575
2  Paris       Août   46550
3  Paris  Septembre   25780
4  Paris    Octobre   23380

In [8]:
tabO = tabR.set_index(['Ville', 'Mois']).unstack().reset_index()
tabO

        Ville Valeur
Mois            Août Décembre Juillet   Juin Novembre Octobre Septembre
0      Berlin  30090    28761    5400  20400    16913   19892     20731
1     Londres  56760    29548   41280  21250    18053   16262     27340
2      Madrid  73255    16355   20375   5705    22062   23284     26445
3       Paris  46550    27996  127575  66150    25956   23380     25780

Modification des titres des colonnes

In [9]:
tabO.columns=['Ville'] + [col[1] for col in tabO.columns[1::]]
tabO

     Ville   Août  Décembre  Juillet   Juin  Novembre  Octobre  Septembre
0   Berlin  30090     28761     5400  20400     16913    19892      20731
1  Londres  56760     29548    41280  21250     18053    16262      27340
2   Madrid  73255     16355    20375   5705     22062    23284      26445
3    Paris  46550     27996   127575  66150     25956    23380      25780